local _, R, _, _ = unpack(select(2, ...))

-- 控制技能列表
R.WhiteList = {
	-- 死亡骑士
	[108194]	= true,		-- 窒息
	[221562]	= true,		-- 窒息
	[207171]	= true,		-- 凛冬将至
	-- 德鲁伊
	[33786] 	= true,		-- 旋风
	[339]		= true,		-- 纠缠根须
	[102359]	= true,		-- 群体缠绕
	[5211]		= true,		-- 蛮力猛击
	[127797]	= true,		-- 乌索尔旋风
	[81261]		= true,		-- 日光术
	-- 猎人
	[3355]		= true,		-- 冰冻陷阱
	[19386] 	= true,		-- 翼龙钉刺
	[213691] 	= true,		-- 驱散射击
	[224729] 	= true,		-- 爆裂射击
	[202797] 	= true,		-- 蝰蛇钉刺
	[202900] 	= true,		-- 毒蝎钉刺
	[117526]	= true,		-- 束缚射击
	-- 法师
	[118] 		= true,		-- 变形术
	-- 圣骑士
	[20066] 	= true,		-- 忏悔
	[853] 		= true,		-- 制裁之锤
	-- 牧师
	[8122] 		= true,		-- 心灵尖啸
	[9484] 		= true,		-- 束缚亡灵
	[15487] 	= true,		-- 沉默
	[605] 		= true,		-- 心控
	[205369] 	= true,		-- 心灵炸弹
	-- 盗贼
	[2094] 		= true,		-- 致盲
	[6770] 		= true,		-- 闷棍
	-- 萨满
	[51514] 	= true,		-- 妖术
	[118905] 	= true,		-- 静电充能
	-- 术士
	[710] 		= true,		-- 放逐术
	[118699] 	= true,		-- 恐惧
	[5484] 		= true,		-- 恐惧嚎叫
	[6358]		= true,		-- 诱惑
	[30283] 	= true,		-- 暗影之怒
	-- 战士
	[132168] 	= true,		-- 震荡波
	[132169] 	= true,		-- 风暴之锤
	-- 武僧
	[115078] 	= true,		-- 分筋错骨
	[119381] 	= true,		-- 扫堂腿
	-- 恶魔猎手
	[217832] 	= true,		-- 禁锢
	[179057] 	= true,		-- 混乱新星
	-- 种族技能
	[28730] 	= true,		-- 奥术洪流
	[20549] 	= true,		-- 战争践踏
	[107079] 	= true,		-- 震山掌
	-- 其他
	[226510]	= true,		-- 血池
	[229495]	= true,		-- 象棋易伤
	[226285]	= true,		-- 恶魔飞升

	[207327]	= true,		-- 净化毁灭，崔利艾克斯
	[236513]	= true,		-- 骨牢护甲，聚合体小怪
	[240315]	= true,		-- 硬化之壳，哈亚坦蛋盾
	[241521]	= true,		-- 折磨碎片，M审判庭小怪
	[250074]	= true,		-- 净化，艾欧娜尔
	[250555]	= true,		-- 邪能护盾，艾欧娜尔
	[246504]	= true,		-- 程式启动，金加洛斯
	[249863]	= true,		-- 泰坦的面容，破坏魔女巫会
	[244903]	= true,		-- 催化作用，阿格拉玛
	[253021]	= true,		-- 宿命，寂灭者阿古斯
	[255496]	= true,		-- 宇宙之剑，寂灭者阿古斯
	[255478]	= true,		-- 永恒之刃，寂灭者阿古斯
	[255418]	= true,		-- 物理易伤，寂灭者阿古斯
	[255425]	= true,		-- 冰霜易伤，寂灭者阿古斯
	[255430]	= true,		-- 暗影易伤，寂灭者阿古斯
	[255429]	= true,		-- 火焰易伤，寂灭者阿古斯
	[255419]	= true,		-- 神圣易伤，寂灭者阿古斯
	[255422]	= true,		-- 自然易伤，寂灭者阿古斯
	[255433]	= true,		-- 奥术易伤，寂灭者阿古斯
}
-- 法术黑名单
R.BlackList = {
	[15407]		= true,		-- 精神鞭笞
	[240606]	= true,		-- 鸟德神器
	[240607]	= true,		-- 鸟德神器
}
-- 显示能量值的敌对单位
R.ShowPowerUnit = {
	["Scrubber"] = true,
	["清扫器"] = true,
	["清掃者"] = true,
}
